In [1]:
%load_ext sql

In [5]:
%sql sqlite:///first-database-sql.db

# 1. Musteri adreslerinin herhangi bir yerinde "da" olanlar?

In [6]:
%%sql
SELECT * FROM Customers LIMIT 5;

 * sqlite:///first-database-sql.db
Done.

[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany'),
 (2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico'),
 (3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico'),
 (4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK'),
 (5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')]

In [37]:
%%sql
SELECT * FROM Customers 
WHERE Address LIKE "%da%" LIMIT 5;

 * sqlite:///first-database-sql.db
Done.

[(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico'),
 (13, 'Centro comercial Moctezuma', 'Francisco Chang', 'Sierras de Granada 9993', 'México D.F.', '5022', 'Mexico'),
 (15, 'Comércio Mineiro', 'Pedro Afonso', 'Av. dos Lusíadas, 23', 'São Paulo', '05432-043', 'Brazil'),
 (28, 'Furia Bacalhau e Frutos do Mar', 'Lino Rodriguez', 'Jardim das rosas n. 32', 'Lisboa', '1675', 'Portugal'),
 (54, 'Océano Atlántico Ltda.', 'Yvonne Moncada', 'Ing. Gustavo Moncada 8585 Piso 20-A', 'Buenos Aires', '1010', 'Argentina')]

# 2. Germany-Berlin' de yasayan musterilerin isimleri?

In [36]:
%%sql
SELECT * FROM Customers 
WHERE Country = "Germany" AND City = "Berlin";

 * sqlite:///first-database-sql.db
Done.

[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany')]

In [35]:
%%sql
SELECT * FROM Customers 
WHERE Country = "Germany" AND City IN ("Berlin") ;

 * sqlite:///first-database-sql.db
Done.

[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany')]

# 3. Canada'da yasayip, isimlerinde "in" ifadesi gecen musteriler?

In [34]:
%%sql
SELECT CustomerName 
FROM Customers 
WHERE CustomerName LIKE "%in%" AND Country = "Canada";

 * sqlite:///first-database-sql.db
Done.

[('Laughing Bacchus Wine Cellars',)]

# 4. Fiyati 40TL-90TL arası olan ürünlerin isimleri ve fiyatlari?

In [33]:
%%sql
SELECT * FROM Products 
WHERE Price BETWEEN 40 AND 90 LIMIT 5;

 * sqlite:///first-database-sql.db
Done.

[(8, 'Northwoods Cranberry Sauce', 3, 2, '12 - 12 oz jars', 40),
 (15, 'Genen Shouyu', 6, 2, '24 - 250 ml bottles', 43),
 (18, 'Carnarvon Tigers', 7, 8, '16 kg pkg.', 62),
 (19, 'Teatime Chocolate Biscuits', 8, 3, '10 boxes x 12 pieces', 43),
 (20, "Sir Rodney's Marmalade", 8, 3, '30 gift boxes', 81)]

In [32]:
%%sql
SELECT ProductName, Price From Products 
WHERE Price <= 90 AND Price >= 40 LIMIT 5;

 * sqlite:///first-database-sql.db
Done.

[('Northwoods Cranberry Sauce', 40),
 ('Genen Shouyu', 43),
 ('Carnarvon Tigers', 62),
 ('Teatime Chocolate Biscuits', 43),
 ("Sir Rodney's Marmalade", 81)]

# 5. Fiyati 30TL'den buyuk olan ürünlerin isimlerini, fiyatlarini ve fiyatlarinin kareleri?  (isimlendirme yaparak bulunuz)

In [38]:
%%sql
SELECT ProductName AS urun_ismi, Price AS Price, Price*Price AS Price_square 
FROM Products WHERE Price >= 30 LIMIT 5;

 * sqlite:///first-database-sql.db
Done.

[("Uncle Bob's Organic Dried Pears", 30, 900),
 ('Northwoods Cranberry Sauce', 40, 1600),
 ('Mishi Kobe Niku', 97, 9409),
 ('Ikura', 31, 961),
 ('Queso Manchego La Pastora', 38, 1444)]